In [2]:
import pandas as pd
import numpy as np

# Initial cleaning for a smaller dataset

In [3]:
#df = pd.read_csv('./CSVs/Small_Dataset/egypt_final.csv', skipinitialspace=True)

In [4]:
#df['city'].value_counts()

In [5]:
#df.drop(df.loc[df['city'] == "Suez"].index, inplace = True)
#df.drop(df.loc[df['city'] == "Giza"].index, inplace = True)
#df.drop(df.loc[df['city'] == "North Coast"].index, inplace = True)
#df.drop(df.loc[df['city'] == "Red Sea"].index, inplace = True)
#df.drop(df.loc[df['city'] == "Alexandria"].index, inplace = True)
#df.drop(df.loc[df['city'] == "Sharqia"].index, inplace = True)
#df.drop(df.loc[df['city'] == "Al Daqahlya"].index, inplace = True)

In [6]:
#df.reset_index(drop = True, inplace = True)

In [7]:
#df.tail()

In [8]:
#df.to_csv('./CSVs/Small_Dataset/cairo_only.csv', index = False)

In [9]:
#df['page'].value_counts()

In [10]:
#df_buy = df.drop(df.loc[(df['page'] == 'comm') | (df['page'] == 'rent')].index)

In [11]:
#df_buy.to_csv('./CSVs/Small_Dataset/cairo_only_buy.csv', index = False)

In [12]:
#df_buy = df_buy.append({'Location': 'Mansheya Nasir, Governorate Egypt, Cairo', 
#           'base_price': 1, 'property_type': 'Informal Settlements', 
#           'city': 'Cairo', "sub_div": 'Governorate Egypt'}, ignore_index = True)

In [14]:
#df_buy = df_buy.append({'Location': 'Ezbet el-Haggana, Nasr City, Egypt', 
#           'base_price': 1, 'property_type': 'Informal Settlements', 
#           'city': 'Cairo', "sub_div": 'Nasr City'}, ignore_index = True)

In [15]:
#df_buy = df_buy.append({'Location': "7 Branshed from Al Soultan Ahmed, El-Darb El-Ahmar, Monsha'et Nasser, Cairo Governorate, Egypt", 
#           'base_price': 1, 'property_type': 'Informal Settlements', 
#           'city': 'Cairo', "sub_div": 'Governorate Egypt'}, ignore_index = True)

In [16]:
#df_buy.tail()

In [17]:
#df_buy.to_csv('./CSVs/Small_Dataset/cairo_only_buy_3slums.csv', index = False)

# Latitude and Longitude CSV

In [18]:
# Reading in the final dataset
df = pd.read_csv('./CSVs/with_coords.csv')

In [19]:
df.head()

,Baths,Beds,Location,Square Meter,base_price,city,country,page,price_usd,property_type,sub_div,lat,lon
0,2,2,"Baymount, Al Ain Al Sokhna, Suez",105,1200000,Suez,Egypt,buy,18876000.0,Chalet,Al Ain Al Sokhna,30.074282,31.544374
1,2,2,"Aroma Residence, Al Ain Al Sokhna, Suez",95,1550000,Suez,Egypt,buy,24381500.0,Chalet,Al Ain Al Sokhna,30.074282,31.544374
2,4,4,"The Courtyards, Sheikh Zayed Compounds, Sheikh...",286,4750000,Giza,Egypt,buy,74717500.0,Townhouse,Sheikh Zayed City,30.048347,30.983223
3,4,5,"Mivida, 5th Settlement Compounds, The 5th Sett...",391,8400000,Cairo,Egypt,buy,132132000.0,Villa,New Cairo City,30.063103,31.455447
4,2,3,"IL Monte Galala, Al Ain Al Sokhna, Suez",119,2900000,Suez,Egypt,buy,45617000.0,Chalet,Al Ain Al Sokhna,30.074282,31.544374

In [30]:
df.rename(columns = {'lat': 'Longitude', 'lon': 'Latitude'}, inplace = True)

In [31]:
# Drop all duplicates
df.drop_duplicates(inplace = True)

In [32]:
# Check the null values
df.isnull().sum()

Baths             460
Beds             1588
Location            0
Square Meter       27
base_price          0
city                0
country             0
page                0
price_usd           0
property_type       0
sub_div             0
Longitude           0
Latitude            0
dtype: int64

In [33]:
# checking the distribution of Latitude and Longitdue
df[['Longitude', 'Latitude']].describe()

         Longitude     Latitude
count  6216.000000  6216.000000
mean     26.636846    27.795596
std       9.535674     9.952087
min       0.000000     0.000000
25%      30.020128    31.243666
50%      30.048819    31.404629
75%      30.063103    31.455447
max      30.969322    31.760475

In [34]:
# Dropping any location outside of Cairo
df.drop(df.loc[df['Longitude'] > 30.3].index, inplace = True)

df.drop(df.loc[df['Longitude'] > 32].index, inplace = True)

df.drop(df.loc[df['Latitude'] < 30].index, inplace = True)

df.drop(df.loc[df['Latitude'] < 31].index, inplace = True)

In [37]:
# checking again
df[['Longitude', 'Latitude']].describe()

         Longitude     Latitude
count  4966.000000  4966.000000
mean     30.046973    31.404273
std       0.036381     0.100907
min      29.550000    31.133333
25%      30.020128    31.296087
50%      30.052118    31.455447
75%      30.063103    31.455447
max      30.290010    31.760475

In [35]:
df.to_csv('./CSVs/coord_no_zeros.csv', index = False)